# 2. Напишите программу, которая запрашивает у пользователя строку и определяет,
# содержит ли она только уникальные символы. Если все символы в строке уникальны,
# выведите соответствующее сообщение на экран. В противном случае выведите сообщение о том, какие символы повторяются.
# Не используйте множества и подобные структуры данных, которые мы пока не изучали, для проверки уникальности символов.
#
# Пример вывода:
# Введите строку: Python
# Все символы в строке уникальны.
# Введите строку: Hello
# Символы 'l' и 'o' повторяются.