# 2. Напишите программу, которая принимает список чисел от пользователя и добавляет каждое число
# в динамический массив. Затем программа должна принимать новое число от пользователя и добавлять его
# в динамический массив до тех пор, пока пользователь не введет команду "Выход".
# Используйте метод append() для добавления элементов в динамический массив и условный оператор
# для проверки команды "Выход". Выведите итоговый динамический массив на экран с помощью команды print.
#
# Пример вывода:
# Введите число (или 'Выход' для завершения): 1
# Введите число (или 'Выход' для завершения): 2
# Введите число (или 'Выход' для завершения): Выход
# Динамический массив: [1, 2]


numbers = []

while True:
    x = input("Введите число (или 'Выход' для завершения): ")

    if x.lower() == "выход":
        break
    else:
        numbers.append(int(x))

# итоговый массив
print("Динамический массив:", numbers)